app/Controllers/Home.php

    public function index()
    {
        $this->authenticate();

        $siswaModel = new SiswaModel();
        $kriteriaModel = new KriteriaModel();

        $data['siswa'] = $siswaModel->getSiswaWithAtributKriteria();
        $data['kriteria'] = $kriteriaModel->findAll(); // Ambil semua data kriteria
---
SELECT *
FROM `kriteria`

    public function datasiswa()
    {
        $siswaModel = new SiswaModel();
        $kriteriaModel = new KriteriaModel();

        $data['siswa'] = $siswaModel->getSiswaWithAtributKriteria();
        $data['kriteria'] = $kriteriaModel->findAll(); // Ambil semua data kriteria
---
SELECT *
FROM `kriteria`

    public function tambahdata()
    {
        $kriteriaModel = new KriteriaModel();
        $data['kriteria'] = $kriteriaModel->findAll(); // Mengambil semua data kriteria
---
SELECT *
FROM `kriteria`

    public function simpanData()
    {
        $siswaModel = new SiswaModel();
        $atributKriteriaModel = new AtributKriteriaModel();

        // Simpan data siswa
        $dataSiswa = [
            'nama' => $this->request->getPost('nama'),
        ];

        $siswaId = $siswaModel->insert($dataSiswa);

        // Simpan nilai kriteria
        $kriteria = $this->request->getPost('kriteria');
        foreach ($kriteria as $kriteriaId => $nilai) {
            $dataAtributKriteria = [
                'siswa_id' => $siswaId,
                'kriteria_id' => $kriteriaId,
                'nilai' => $nilai,
            ];

            $atributKriteriaModel->insert($dataAtributKriteria);
---
INSERT INTO `siswa` (`nama`) VALUES ('faiz')
INSERT INTO `atribut_kriteria` (`siswa_id`, `kriteria_id`, `nilai`) VALUES (6, 5, '25')

    public function hitungMOORA()
    {
        $siswaModel = new SiswaModel();
        $kriteriaModel = new KriteriaModel(); // Sesuaikan dengan model yang digunakan
        $atributKriteriaModel = new AtributKriteriaModel(); // Sesuaikan dengan model yang digunakan

        $dataSiswa = $siswaModel->findAll();
        $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `siswa`
SELECT *
FROM `kriteria`

                'nilai_total' => $siswa['nilai_total'],
            ];
        }
        $inserted = $hasilModel->insertBatch($dataToInsert);
---
INSERT INTO `hasil` (`nama`, `nilai_total`)
VALUES ('faiz',1.3), ('agung',0.2)

    public function hasil()
    {
        $hasilModel = new HasilModel();
        $data['hasil'] = $hasilModel->orderBy('nilai_total', 'DESC')->findAll();
---
SELECT *
FROM `hasil`
ORDER BY `nilai_total` DESC