app/Models/AtributKriteriaModel.php

SELECT *
FROM `atribut_kriteria`
WHERE `siswa_id` = '5'
AND `kriteria_id` = '5'
---
    public function getNilaiAtribut($siswaId, $kriteriaId)
    {
        return $this->where(['siswa_id' => $siswaId, 'kriteria_id' => $kriteriaId])
            ->get()
            ->getRow('nilai');