app/Models/KriteriaModel.php

    public function insertKriteria($data)
    {
        return $this->insert($data);
---
INSERT INTO `kriteria` (`nama_kriteria`, `bobot`) VALUES ('kepinteran', '0.5')