app/Models/SiswaModel.php

SELECT `siswa`.*, GROUP_CONCAT(atribut_kriteria.nilai ORDER BY atribut_kriteria.kriteria_id) as nilai_kriteria
FROM `siswa`
LEFT JOIN `atribut_kriteria` ON `siswa`.`id` = `atribut_kriteria`.`siswa_id`
GROUP BY `siswa`.`id`
---
    public function getSiswaWithAtributKriteria()
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*, GROUP_CONCAT(atribut_kriteria.nilai ORDER BY atribut_kriteria.kriteria_id) as nilai_kriteria');
        $builder->join('atribut_kriteria', 'siswa.id = atribut_kriteria.siswa_id', 'left');
        $builder->groupBy('siswa.id');

        return $builder->get()->getResultArray();